# Pandas

In [2]:
import pandas as pd
import numpy as np

arr = np.array([2,3,4,5,6,7,8])
sr = pd.Series(arr)
print(sr)

0    2
1    3
2    4
3    5
4    6
5    7
6    8
dtype: int32

In [3]:
data = {'a':[1,2,3], 'b':[11,12,13], 'c':[21,22,23]}

df = pd.DataFrame(data)
print(df)

   a   b   c
0  1  11  21
1  2  12  22
2  3  13  23

In [4]:
d = {'name':'Snehal','age':22,'subjects':['C','C++','HTML','Java','Python']}
df = pd.DataFrame(d)
print(df)

     name  age subjects
0  Snehal   22        C
1  Snehal   22      C++
2  Snehal   22     HTML
3  Snehal   22     Java
4  Snehal   22   Python

In [5]:
a = np.array([1,2,3,4])
b = np.array(['A','B','C','D'])
c = np.array(['Kop','San','Sat','Pune'])

d = {'id':a, 'name':b, 'address':c}
df = pd.DataFrame(d)
print(df)

   id name address
0   1    A     Kop
1   2    B     San
2   3    C     Sat
3   4    D    Pune

In [12]:
lst = [['id','name','address'], [1,2,3,4], ['A','B','C','D'], ['Kop','San','Sat','Pune']]
df = pd.DataFrame(dict(zip(lst[0],lst[1:])))
print(df)

   id name address
0   1    A     Kop
1   2    B     San
2   3    C     Sat
3   4    D    Pune

In [10]:
df =dict(zip(lst[0],lst[1:]))
print(df)

{'id': [1, 2, 3, 4], 'name': ['A', 'B', 'C', 'D'], 'address': ['Kop', 'San', 'Sat', 'Pune']}

In [11]:
df = pd.DataFrame(dict(zip(lst[0],lst[1:])))
print(df)

   id name address
0   1    A     Kop
1   2    B     San
2   3    C     Sat
3   4    D    Pune

# Pandas data manipulation

In [2]:
import pandas as pd
import numpy as np

In [3]:
arr=np.array([1,2,3,4,5,6,7,8,9]).reshape(3,3)
print(arr)

[[1 2 3]
 [4 5 6]
 [7 8 9]]

# Advanced indexing and selection

In [4]:
### Multi level indexing: create dataframes with multiple level of indexex 
# to work with multi dimensional data

In [7]:
import pandas as pd
data={'A':[1,2,3,4,5],
      'B':[11,22,33,44,55],
      'C':[111,222,333,444,555]}

In [10]:
data
df=data.copy()
df

{'A': [1, 2, 3, 4, 5],
 'B': [11, 22, 33, 44, 55],
 'C': [111, 222, 333, 444, 555]}

In [11]:
data=pd.DataFrame({'Brand': ['Maruti', 'Hyundai', 'Tata',
                               'Mahindra', 'Maruti', 'Hyundai',
                               'Renault', 'Tata', 'Maruti'],
                     'Year': [2012, 2014, 2011, 2015, 2012,
                              2016, 2014, 2018, 2019],
                     'Kms Driven': [50000, 30000, 60000,
                                    25000, 10000, 46000,
                                    31000, 15000, 12000],
                     'City': ['Gurgaon', 'Delhi', 'Mumbai',
                              'Delhi', 'Mumbai', 'Delhi',
                              'Mumbai', 'Chennai',  'Ghaziabad'],
                     'Mileage':  [28, 27, 25, 26, 28,
                                  29, 24, 21, 24]})

In [12]:
# using loc[] for labeled indexing
data

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [13]:
display(data)

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [14]:
# loc() function is label based data selecting

In [16]:
# selecting cars with brand 'Maruti' and Mileage > 25

d=data.loc[(data['Brand']=='Maruti') & (data.Mileage>25)]

In [17]:
d

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
4  Maruti  2012       10000   Mumbai       28

In [19]:
# selecting range of rows from 2 to 5
d=data.loc[2:5]

In [20]:
d

      Brand  Year  Kms Driven    City  Mileage
2      Tata  2011       60000  Mumbai       25
3  Mahindra  2015       25000   Delhi       26
4    Maruti  2012       10000  Mumbai       28
5   Hyundai  2016       46000   Delhi       29

In [24]:
# updating values of Mileage if Year < 2015

d=data.loc[(data.Year<2015),['Mileage']]=22

In [25]:
d

22

In [29]:
d=data.loc[(data.Mileage==22),['Year']]=2023

In [30]:
d

2023

In [31]:
display(data)

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2023       50000    Gurgaon       22
1   Hyundai  2023       30000      Delhi       22
2      Tata  2023       60000     Mumbai       22
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2023       10000     Mumbai       22
5   Hyundai  2016       46000      Delhi       29
6   Renault  2023       31000     Mumbai       22
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [32]:
## python iloc()function

In [34]:
# selecting 0th, 2nd, 4th, and 7th index rows

d=data.iloc[[0,2,4,7]]

In [35]:
d

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2023       50000  Gurgaon       22
2    Tata  2023       60000   Mumbai       22
4  Maruti  2023       10000   Mumbai       22
7    Tata  2018       15000  Chennai       21

In [38]:
# selecting rows from 1 to 4 and columns from 2 to 4

d=data.iloc[1:5,2:5]

In [39]:
d

   Kms Driven    City  Mileage
1       30000   Delhi       22
2       60000  Mumbai       22
3       25000   Delhi       26
4       10000  Mumbai       22

### Combining DataFrames

In [44]:
df1=pd.DataFrame({'ID':[1,2,3],'Name':['apple','orange','banana']})

In [45]:
df2=pd.DataFrame({'ID':[2,3,4],'Kg':[2,4,3]})

In [46]:
merged=pd.merge(df1, df2, on='ID', how='inner')

In [47]:
print(merged)

   ID    Name  Kg
0   2  orange   2
1   3  banana   4

In [48]:
display(merged)

   ID    Name  Kg
0   2  orange   2
1   3  banana   4

In [52]:
# concatenating dataframe using concat():
df1=pd.DataFrame({'A':[1,2],'B':[3,4]})
df2=pd.DataFrame({'A':[1,2],'B':[44,55]})

In [53]:
meg=pd.merge(df1,df2, on="A",how='inner')

In [54]:
meg

   A  B_x  B_y
0  1    3   44
1  2    4   55

In [55]:
# concatenating dataframe using concat():
df1=pd.DataFrame({'A':[1,2],'B':[3,4]})
df2=pd.DataFrame({'A':[1,2],'B':[44,55]})

In [57]:
cont=pd.concat([df1,df2])

In [58]:
display(cont)

   A   B
0  1   3
1  2   4
0  1  44
1  2  55

# Data Manipulation

In [59]:
# filtering and subsetting data based on condition

In [60]:
data=pd.DataFrame({'Brand': ['Maruti', 'Hyundai', 'Tata',
                               'Mahindra', 'Maruti', 'Hyundai',
                               'Renault', 'Tata', 'Maruti'],
                     'Year': [2012, 2014, 2011, 2015, 2012,
                              2016, 2014, 2018, 2019],
                     'Kms Driven': [50000, 30000, 60000,
                                    25000, 10000, 46000,
                                    31000, 15000, 12000],
                     'City': ['Gurgaon', 'Delhi', 'Mumbai',
                              'Delhi', 'Mumbai', 'Delhi',
                              'Mumbai', 'Chennai',  'Ghaziabad'],
                     'Mileage':  [28, 27, 25, 26, 28,
                                  29, 24, 21, 24]})

In [62]:
display(data)

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [64]:
data.shape

(9, 5)

In [65]:
data.size

45

In [66]:
data.head(2)

     Brand  Year  Kms Driven     City  Mileage
0   Maruti  2012       50000  Gurgaon       28
1  Hyundai  2014       30000    Delhi       27

In [70]:
#filtering
d=data[data.Year<2015]

In [71]:
d

     Brand  Year  Kms Driven     City  Mileage
0   Maruti  2012       50000  Gurgaon       28
1  Hyundai  2014       30000    Delhi       27
2     Tata  2011       60000   Mumbai       25
4   Maruti  2012       10000   Mumbai       28
6  Renault  2014       31000   Mumbai       24

In [72]:
d=data[data['City']=='Mumbai']

In [73]:
d

     Brand  Year  Kms Driven    City  Mileage
2     Tata  2011       60000  Mumbai       25
4   Maruti  2012       10000  Mumbai       28
6  Renault  2014       31000  Mumbai       24

In [75]:
# sorting and ranking

d=data.sort_values(by='Year',ascending=False)

In [76]:
d

      Brand  Year  Kms Driven       City  Mileage
8    Maruti  2019       12000  Ghaziabad       24
7      Tata  2018       15000    Chennai       21
5   Hyundai  2016       46000      Delhi       29
3  Mahindra  2015       25000      Delhi       26
1   Hyundai  2014       30000      Delhi       27
6   Renault  2014       31000     Mumbai       24
0    Maruti  2012       50000    Gurgaon       28
4    Maruti  2012       10000     Mumbai       28
2      Tata  2011       60000     Mumbai       25

In [77]:
d=data.sort_values(by='Mileage',ascending=True)

In [78]:
d

      Brand  Year  Kms Driven       City  Mileage
7      Tata  2018       15000    Chennai       21
6   Renault  2014       31000     Mumbai       24
8    Maruti  2019       12000  Ghaziabad       24
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
1   Hyundai  2014       30000      Delhi       27
0    Maruti  2012       50000    Gurgaon       28
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29

In [79]:
d['Rank']=data.Mileage.rank(ascending=False)

In [80]:
d

      Brand  Year  Kms Driven       City  Mileage  Rank
7      Tata  2018       15000    Chennai       21   9.0
6   Renault  2014       31000     Mumbai       24   7.5
8    Maruti  2019       12000  Ghaziabad       24   7.5
2      Tata  2011       60000     Mumbai       25   6.0
3  Mahindra  2015       25000      Delhi       26   5.0
1   Hyundai  2014       30000      Delhi       27   4.0
0    Maruti  2012       50000    Gurgaon       28   2.5
4    Maruti  2012       10000     Mumbai       28   2.5
5   Hyundai  2016       46000      Delhi       29   1.0

In [81]:
d['Rank']=data.Mileage.rank(ascending=True)

In [82]:
d

      Brand  Year  Kms Driven       City  Mileage  Rank
7      Tata  2018       15000    Chennai       21   1.0
6   Renault  2014       31000     Mumbai       24   2.5
8    Maruti  2019       12000  Ghaziabad       24   2.5
2      Tata  2011       60000     Mumbai       25   4.0
3  Mahindra  2015       25000      Delhi       26   5.0
1   Hyundai  2014       30000      Delhi       27   6.0
0    Maruti  2012       50000    Gurgaon       28   7.5
4    Maruti  2012       10000     Mumbai       28   7.5
5   Hyundai  2016       46000      Delhi       29   9.0

## Aggregating and summarizing data using groupby()

In [86]:
gp=d.groupby(['Brand',"City"])['Mileage'].mean()

In [87]:
gp

Brand     City
Hyundai   Delhi        28.0
Mahindra  Delhi        26.0
Maruti    Ghaziabad    24.0
          Gurgaon      28.0
          Mumbai       28.0
Renault   Mumbai       24.0
Tata      Chennai      21.0
          Mumbai       25.0
Name: Mileage, dtype: float64

In [89]:
gp=d.groupby(['Year','City'])['Mileage'].mean()

In [90]:
gp

Year  City
2011  Mumbai       25.0
2012  Gurgaon      28.0
      Mumbai       28.0
2014  Delhi        27.0
      Mumbai       24.0
2015  Delhi        26.0
2016  Delhi        29.0
2018  Chennai      21.0
2019  Ghaziabad    24.0
Name: Mileage, dtype: float64

# pivoit

In [91]:
data = {
    'Id': [1,2,3,4,5],
    'Name': ['A', 'B', 'C', 'D', 'E'],
    'City': ['Kolhapur', 'Pune', 'Sangli', 'Satara', 'Mumbai'],
    'Age': [21, 23, 56, 34, 68],
    'Salary': [23000, 45000, 35000, 78000, 56000],
    'Year': [2021, 2018, 2023, 2015, 2019]
}

In [92]:
data=pd.DataFrame(data)

In [93]:
data

   Id Name      City  Age  Salary  Year
0   1    A  Kolhapur   21   23000  2021
1   2    B      Pune   23   45000  2018
2   3    C    Sangli   56   35000  2023
3   4    D    Satara   34   78000  2015
4   5    E    Mumbai   68   56000  2019

In [94]:
pv=data.pivot(index='City',columns='Year',values='Salary')

In [95]:
pv

Year         2015     2018     2019     2021     2023
City
Kolhapur      NaN      NaN      NaN  23000.0      NaN
Mumbai        NaN      NaN  56000.0      NaN      NaN
Pune          NaN  45000.0      NaN      NaN      NaN
Sangli        NaN      NaN      NaN      NaN  35000.0
Satara    78000.0      NaN      NaN      NaN      NaN

In [96]:
pv=data.pivot(index='Name',columns='Year',values='Age')

In [97]:
pv

Year  2015  2018  2019  2021  2023
Name
A      NaN   NaN   NaN  21.0   NaN
B      NaN  23.0   NaN   NaN   NaN
C      NaN   NaN   NaN   NaN  56.0
D     34.0   NaN   NaN   NaN   NaN
E      NaN   NaN  68.0   NaN   NaN

## melt

In [99]:
# Melt dataframe is used to convert columns to row

In [101]:
# creating a dataframe
df = pd.DataFrame({'Name': {0: 'John', 1: 'Bob', 2: 'Shiela'},
                   'Course': {0: 'Masters', 1: 'Graduate', 2: 'Graduate'},
                   'Age': {0: 27, 1: 23, 2: 21}})

In [102]:
df

     Name    Course  Age
0    John   Masters   27
1     Bob  Graduate   23
2  Shiela  Graduate   21

In [103]:
df = pd.DataFrame({'Name': [ 'John',  'Bob', 'Shiela'],
                   'Course': [ 'Masters', 'Graduate', 'Graduate'],
                   'Age': [ 27, 23, 21]})

In [104]:
df

     Name    Course  Age
0    John   Masters   27
1     Bob  Graduate   23
2  Shiela  Graduate   21

In [108]:
mt=pd.melt(df, id_vars=['Name'],value_vars=['Age'])

In [109]:
mt

     Name variable  value
0    John      Age     27
1     Bob      Age     23
2  Shiela      Age     21

In [110]:
mt=pd.melt(df, id_vars=['Name','Age'], value_vars='Course')

In [111]:
mt

     Name  Age variable     value
0    John   27   Course   Masters
1     Bob   23   Course  Graduate
2  Shiela   21   Course  Graduate

In [118]:
mt=pd.melt(df,id_vars=['Course'], value_vars=['Age','Name'])

In [119]:
mt

     Course variable   value
0   Masters      Age      27
1  Graduate      Age      23
2  Graduate      Age      21
3   Masters     Name    John
4  Graduate     Name     Bob
5  Graduate     Name  Shiela

In [120]:
# using str.contains() to filter rows with text containing 'a'

In [121]:
data

   Id Name      City  Age  Salary  Year
0   1    A  Kolhapur   21   23000  2021
1   2    B      Pune   23   45000  2018
2   3    C    Sangli   56   35000  2023
3   4    D    Satara   34   78000  2015
4   5    E    Mumbai   68   56000  2019

In [126]:
st=data[data.City.str.contains('a')]

In [127]:
st

   Id Name      City  Age  Salary  Year
0   1    A  Kolhapur   21   23000  2021
2   3    C    Sangli   56   35000  2023
3   4    D    Satara   34   78000  2015
4   5    E    Mumbai   68   56000  2019

In [128]:
st=data[data.Name.str.contains('A')]

In [129]:
st

   Id Name      City  Age  Salary  Year
0   1    A  Kolhapur   21   23000  2021

In [130]:
## Working with JSON

In [137]:
df

{'Name': 'John', 'Course': 'Masters', 'Age': 27}

In [141]:
# Reading JSON data into a DataFrame
import json

json_data = '{"name": "John", "age": 30, "city": "New York"}'
df = pd.DataFrame(json.loads(json_data), index=[0])
print(df)

   name  age      city
0  John   30  New York